content/mullvad.md
+++
title = "Mullvad Application"
author = ["Markus Pettersson"]
draft = false
creator = "Emacs 29.0.50 (Org mode 9.6 + ox-hugo)"
+++

Hello there, moles! 👋

This is the cover letter for my formal application to Mullvad.

My name is Markus Pettersson. If you haven't already, check the [About section](/about) to
find out more about who I am. In short, I'm a 24 years old software engineer who
loves open source, well-written documentation, functional programming &amp;
specialty coffee ☕

But now, let's get to the interesting bits: **Why am I applying to work at
Mullvad?** Because I think that you are genuinely a good workplace for someone
like me. I want to do something meaningful as an engineer, but sadly, I think
lots of time &amp; resources are spent developing things that are not meaningful. In
my opinion, technology should be used for the common good, not the wealthy few.
Software should serve the users, not corporate stakeholders. And maybe most
importantly, software should work well, which requires attention,
conscientiousness and respect for the craft that is programming.

My image of Mullvad grew during my studies at Chalmers, where I got to talk to
some smart people who also happened to take privacy seriously. They used
Mullvad, because your VPN is transparent and works well with truly minimal
intrusion. Auto-generated account numbers, pay by mailing cash and the banner on
your site that tells whether the user is browsing from a secure connection. All
these things feel so obvious, but they show how far ahead you are compared to
competing VPN services in actually caring about the end user's best interest.

I also remember reading the blog post [Open source firmware is the future](https://mullvad.net/sv/blog/2019/8/7/open-source-firmware-future/), which
coincided with me exploring if I could get my hands on one of the early RISC-V
SBCs to deploy in my homelab. I remember feeling the desire to work at a place
where such thoughts are taking seriously: as fundamental as computers are in
today's society, they have no right to be the black boxes that they currently
are.

**What I can bring to the table** is a genuine interest in making the world a
little better, one line of code at a time. As far as I can tell, my personal
beliefs align well with Mullvad's core values, which I've come to learn is
crucial for my motivation &amp; happiness. Therefore, I am confident that a career
at Mullvad could become a sustainable, long-term investment for both parties.

I enjoy learning new technologies, especially programming languages. I try to
attend as many local developer meetups as I can manage, among them the [Rust Gbg](https://www.meetup.com/rustgbg/?_cookie-check=Tn0Gtbp-Fc9o1EMt)
meetups where I've bumped into your guy: Linus Färnstrand. As a self-proclaimed
polyglot with [professional experience from all-over the tech stack-spectrum](/cv.pdf), I
have an easy time to pick up new skills &amp; tools as needed.

Personally, I think this application is way overdue, and I'm happy that I
finally took the plunge. My hopes are that we can engage in a closer
conversation soon.

Until then, stay hidden out there 👋
